In [4]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy import nan as NA

a9 = np.arange(9).reshape(3, 3)
a12 = np.arange(12).reshape(3, 4)
a20 = np.arange(20).reshape(4, 5)

df9 = DataFrame(a9, index=list('abc'), columns=list('uvw'))
df12 = DataFrame(a12, index=list('abc'), columns=list('uvwx'))
df20 = DataFrame(a20, index=list('abcd'), columns=list('uvwxy'))

s9 = Series(np.arange(9))

In [6]:
s = Series(['aa', 1, 2, NA, 'ss', '3', NA, 4])

In [11]:
s.fillna(1)

0    aa
1     1
2     2
3     1
4    ss
5     3
6     1
7     4
dtype: object

In [12]:
df1 = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [18]:
df1

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df1.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [59]:
df = DataFrame(np.random.randn(4, 3))
df.iloc[:3, 0] = NA
df.iloc[:2, 1] = NA
df.iloc[:1, 2] = NA
df

          0         1         2
0       NaN       NaN       NaN
1       NaN       NaN -0.790887
2       NaN  0.199490  1.588735
3  1.315957 -1.910135 -0.853927

In [37]:
df.dropna(thresh=1)

          0         1         2
0  0.526489       NaN       NaN
1  0.393857       NaN  2.090832
2 -0.540339  0.471756 -1.266796
3  0.721037 -0.057631  1.080056

In [54]:
df.fillna(method='bfill', limit=1)

          0         1         2
0  0.526489       NaN  2.090832
1  0.393857  0.471756  2.090832
2 -0.540339  0.471756 -1.266796
3  0.721037 -0.057631  1.080056

In [57]:
def fillMean(df):
    dic = {v:df[v].mean() for v in df.columns}
    return df.fillna(dic)

In [60]:
fillMean(df)

          0         1         2
0  1.315957 -0.855322 -0.018693
1  1.315957 -0.855322 -0.790887
2  1.315957  0.199490  1.588735
3  1.315957 -1.910135 -0.853927

In [61]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [62]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [63]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [67]:
data.drop_duplicates(['k2'], keep='last')

    k1  k2
1  two   1
2  one   2
4  one   3
6  two   4

In [68]:
foods = ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef','Bacon','pastrami', 'honey ham', 'novalox']
ounces = [4, 3, 12, 6, 7.5, 8, 3, 5, 6]
data = pd.DataFrame({'food': foods, 'ounces': ounces})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8      novalox     6.0

In [86]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'novalox': 'salmon'
}

In [89]:
data['animal'] = data['food'].map(lambda x: meat_to_animal[x.lower()])
data['animal1'] = data['food'].str.lower().map(meat_to_animal)
data

          food  ounces  animal animal1
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8      novalox     6.0  salmon  salmon

In [91]:
data.replace?

In [92]:
data = pd.DataFrame(a12, index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])

In [94]:
data.index.map(lambda x: x[:4].upper())

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [106]:
data.rename(index=str.title, columns={'one': 1})

          1  two  three  four
Ohio      0    1      2     3
Colorado  4    5      6     7
New York  8    9     10    11

In [109]:
data.reindex(['one'], axis=1)

          one
Ohio        0
Colorado    4
New York    8

In [133]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins, labels=group_names)
cats

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [134]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [135]:
cats.categories

Index(['Youth', 'YoungAdult', 'MiddleAged', 'Senior'], dtype='object')

In [139]:
cat0 = cats[0]
cat0, type(cat0)

('Youth', str)

In [141]:
t = cats.value_counts()
t

Youth         5
YoungAdult    3
MiddleAged    3
Senior        1
dtype: int64

In [142]:
t.index[0]

'Youth'

In [143]:
data = np.random.randn(20)
cats = pd.cut(data, 4, precision=2)
cats

[(0.12, 1.01], (-1.66, -0.77], (-1.66, -0.77], (0.12, 1.01], (-0.77, 0.12], ..., (-1.66, -0.77], (1.01, 1.89], (-0.77, 0.12], (0.12, 1.01], (0.12, 1.01]]
Length: 20
Categories (4, interval[float64]): [(-1.66, -0.77] < (-0.77, 0.12] < (0.12, 1.01] < (1.01, 1.89]]

In [145]:
data = np.random.randn(100)
cats = pd.qcut(data, 4)
cats

[(-2.6959999999999997, -0.737], (-2.6959999999999997, -0.737], (0.0708, 0.675], (0.675, 2.515], (0.675, 2.515], ..., (-2.6959999999999997, -0.737], (0.675, 2.515], (-2.6959999999999997, -0.737], (-2.6959999999999997, -0.737], (-0.737, 0.0708]]
Length: 100
Categories (4, interval[float64]): [(-2.6959999999999997, -0.737] < (-0.737, 0.0708] < (0.0708, 0.675] < (0.675, 2.515]]

In [146]:
cats.value_counts()

(-2.6959999999999997, -0.737]    25
(-0.737, 0.0708]                 25
(0.0708, 0.675]                  25
(0.675, 2.515]                   25
dtype: int64

In [151]:
data = np.random.randn(100)
cats = pd.qcut(data, [0, 0.1, 0.5, 0.8, 1])
cats.value_counts()

(-2.586, -1.041]    10
(-1.041, 0.0546]    40
(0.0546, 0.593]     30
(0.593, 3.038]      20
dtype: int64

In [152]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [159]:
t = data[2] > 2.5
t.sum()

6

In [160]:
data[t]

            0         1         2         3
37  -0.966558  0.128679  2.588053  0.660809
96   0.461914 -0.011701  2.670770  0.924129
316 -0.308732  0.242966  2.583178 -0.124341
479  0.766774 -0.053517  2.960860 -0.994141
808 -0.179466  1.805014  2.667948  2.140869
863  0.390512  0.270473  2.580549  0.724652

In [172]:
t = np.fabs(data) > 3
data[t.any(1)]

            0         1         2         3
310  0.073768  1.259370 -1.890544  3.092443
357  0.464614 -1.230208  0.957725  3.035875
620  1.114681 -3.036147 -1.735742 -1.155774
703  3.353262 -1.186629  0.034318 -0.321645
891 -1.348443  0.740685  1.752419 -3.436507
961 -0.658696 -4.881164  2.020449 -1.907158
984 -0.394853 -0.373895 -1.410470  3.117190

In [173]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [175]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.000212    -0.053992     0.014225    -0.024234
std       0.969310     0.980790     0.982949     0.980341
min      -2.943714    -3.000000    -2.812043    -3.000000
25%      -0.645243    -0.745404    -0.621255    -0.701814
50%      -0.016578    -0.040638     0.021248    -0.003268
75%       0.622333     0.627308     0.648513     0.625566
max       3.000000     2.625092     2.960860     3.000000

In [184]:
p = np.random.permutation(4)
p

array([0, 2, 3, 1])

In [189]:
df20.iloc[p]
df20.take(p)

    u   v   w   x   y
a   0   1   2   3   4
c  10  11  12  13  14
d  15  16  17  18  19
b   5   6   7   8   9

In [199]:
df20.sample(6, axis=1, replace=True)

    u   u   y   x   y   x
a   0   0   4   3   4   3
b   5   5   9   8   9   8
c  10  10  14  13  14  13
d  15  15  19  18  19  18

In [196]:
df20

    u   v   w   x   y
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

In [200]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

In [206]:
s9s = s9.sample(n = 9)
s9s

2    2
4    4
5    5
1    1
0    0
3    3
7    7
6    6
8    8
dtype: int32

In [212]:
pd.get_dummies(df)

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [217]:
df[['key']].join(df)

ValueError: columns overlap but no suffix specified: Index(['key'], dtype='object')

In [218]:
t = df[['key']]

In [223]:
t.columns = ['key1']

In [225]:
t.join(df)

  key1 key  data1
0    b   b      0
1    b   b      1
2    a   a      2
3    c   c      3
4    a   a      4
5    b   b      5

In [226]:
pd.get_dummies(df['key'], prefix='key1')

   key1_a  key1_b  key1_c
0       0       1       0
1       0       1       0
2       1       0       0
3       0       0       1
4       1       0       0
5       0       1       0

In [230]:
s = 'sssssssssssssssssss'
s.count('s')

19

In [231]:
import re

In [232]:
text = 'asdf ss \t  ssq\n\t erer'

In [234]:
re.split('\s+', text)

['asdf', 'ss', 'ssq', 'erer']

In [235]:
regex = re.compile('\s+')

In [237]:
regex.split(text)

['asdf', 'ss', 'ssq', 'erer']

In [240]:
regex.findall(text)

[' ', ' \t  ', '\n\t ']

In [242]:
t = regex.search(text)

In [244]:
t.span()

(4, 5)

In [246]:
r = regex.match(text)

In [248]:
type(r)

NoneType

In [249]:
text[t.start():t.end()]

' '

In [251]:
regex.sub('_ss_', text)

'asdf_ss_ss_ss_ssq_ss_erer'

In [253]:
pattern = r'([a-z0-9._%+-]+)@([a-z0-9.-]+)\.([a-z]{2,4})'
regex = re.compile(pattern)

In [254]:
t = regex.match('2222@tee.cn')

In [260]:
t.groups()

('2222', 'tee', 'cn')

In [261]:
regex.sub(r'UserName:\1, Domain:\2, Suffix:\3', '2222@tee.cn')

'UserName:2222, Domain:tee, Suffix:cn'

In [262]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [263]:
s = Series(data)

In [264]:
s

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [265]:
s.str.contains('com')

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [268]:
t = s.str.findall(regex)

In [272]:
t['Dave'][0][0]

'dave'

In [274]:
s.str.get(1)

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [276]:
s.str[120]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [278]:
s.str.join('%')

Dave     d%a%v%e%@%g%o%o%g%l%e%.%c%o%m
Steve    s%t%e%v%e%@%g%m%a%i%l%.%c%o%m
Rob          r%o%b%@%g%m%a%i%l%.%c%o%m
Wes                                NaN
dtype: object

In [282]:
s.str.cat()

'dave@google.comsteve@gmail.comrob@gmail.com'

In [285]:
s.str.count('o')

Dave     3.0
Steve    1.0
Rob      2.0
Wes      NaN
dtype: float64

In [290]:
s.str.repeat?